<a href="https://colab.research.google.com/github/DhanasekarChellamuthu/Machine_learning-NN/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
data_input=pd.read_csv("/content/drive/My Drive/Colab Notebooks/datascience_class/kaggle_titanic/train.csv")

In [11]:
data_input.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]

In [0]:
# it will pop survived column in data_input and also returns the value of that removed column value
y=data_input.pop("Survived")
model.predict(x)

In [0]:
# data_input.head(1)
# y

In [19]:
#Selecting Numerical values alone
x=data_input.drop(['Name','Ticket','Cabin','Embarked'],axis=1)
x.head(1)

   PassengerId  Pclass   Sex   Age  SibSp  Parch  Fare
0            1       3  male  22.0      1      0  7.25

In [0]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()

In [28]:
x['Sex']=labelencoder.fit_transform(x['Sex'])
x.head(2)

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0            1       3    1  22.0      1      0   7.2500
1            2       1    0  38.0      1      0  71.2833

In [33]:
x.head(10)

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0            1       3    1  22.0      1      0   7.2500
1            2       1    0  38.0      1      0  71.2833
2            3       3    0  26.0      0      0   7.9250
3            4       1    0  35.0      1      0  53.1000
4            5       3    1  35.0      0      0   8.0500
5            6       3    1   NaN      0      0   8.4583
6            7       1    1  54.0      0      0  51.8625
7            8       3    1   2.0      3      1  21.0750
8            9       3    0  27.0      0      2  11.1333
9           10       2    0  14.0      1      0  30.0708

In [0]:
#passenger ID 6 has actually no age but now we applied with mean value
x['Age'].fillna(x.Age.mean(), inplace=True)
x.head(10)

In [0]:
import numpy as np
from sklearn.metrics import accuracy_score
from sklearn.linear_model import LogisticRegression

In [0]:
model = LogisticRegression(random_state = 0)
model.fit(x,y)
# accuracy_score(True_data,Prediction_data,normalization=True or False)
# normalization True=percentage ot true prediction , false= count of classified samples

In [40]:
test=pd.read_csv ("/content/drive/My Drive/Colab Notebooks/datascience_class/kaggle_titanic/test.csv")
test=test.drop(['Name','Ticket','Cabin','Embarked'],axis=1)
test.head(100)

    PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare
0           892       3    male  34.5      0      0   7.8292
1           893       3  female  47.0      1      0   7.0000
2           894       2    male  62.0      0      0   9.6875
3           895       3    male  27.0      0      0   8.6625
4           896       3  female  22.0      1      1  12.2875
..          ...     ...     ...   ...    ...    ...      ...
95          987       3    male  25.0      0      0   7.7958
96          988       1  female  76.0      1      0  78.8500
97          989       3    male  29.0      0      0   7.9250
98          990       3  female  20.0      0      0   7.8542
99          991       3    male  33.0      0      0   8.0500

[100 rows x 7 columns]

In [0]:
test['Sex']=labelencoder.fit_transform(test['Sex'])
test["Age"].fillna(test.Age.mean(), inplace=True)
test["Fare"].fillna(test.Fare.mean(), inplace=True)
y_pred = model.predict(test)
y_pred

In [45]:
submission = pd.DataFrame({
"PassengerId":test[
"PassengerId"], "Survived" : y_pred})
submission.to_csv('/content/drive/My Drive/Colab Notebooks/datascience_class/kaggle_titanic/Titanic_KNN.csv', index=False)
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1